package com.javaex.practice;

public class Ex06 {
	public static void main(String[] args) {
		/* 아래의 설명중 틀린 것을 찾아서 수정해 보세요.
			(1) 변수한개에는 동시에 여러 개의 값을 담을 수 있다. -> 동시에 여러개의 값을 가지진않음. 한번에 1개만 같은 자료형의 값만 담을 수 있음
			(2) 변수는 선언시에 사용한 타입의 값만 저장할 수 있다. 0
?			(3) 변수는 초기값이 저장되지 않아도 읽을 수 있다. -> 초기값이 저장되어야 사용할 수 있다.
?			(4) 모든 자료형의 변수는 동일한 방식으로 저장된다. -> 자료형에 따라 저장방식이 다르다.
			(5) double형은 flaot보다 큰 수를 담을 수 있다. 0
			(6) int, float, char, String은 모두 기본자료형에 속한다. -> String은 기본 자료형이 아닌 참조자료형이다. 
			(7) final로 선언된 변수는 수정이 가능하다 -> final로 선언된 변수는 상수라 부르며 한번 초기화된 값은 변경x. 보통 상수로 선언된 상수명은 대문자로 표기하여 구분한다.
			(8) long형은 항상 L을 붙여서 대입해야한다. -> int에 해당하는 범위에서는 L을 안붙여도된다.
			(9) float형은 항상 F을 분여서 대입해야한다. -> 0                             

		 */
	}
}
